[
    {
        "pattern": "축구는 param1 명이 param2 팀입니다. param3 명의 선수를 똑같이 나누어 축구팀을 만들려고 합니다. 남는 선수가 없도록 팀을 만들려면 몇 명이 더 있어야 합니까?",
        "problem": "축구는 11 명이 한 팀입니다. 95 명의 선수를 똑같이 나누어 축구팀을 만들려고 합니다. 남는 선수가 없도록 팀을 만들려면 몇 명이 더 있어야 합니까?",
        "keyword": "vkey는 param1 명이 param2 팀입니다. param3 명의 선수를 똑같이 나누어 vkey팀을 만들려고 합니다. 남는 선수가 없도록 팀을 만들려면 몇 명이 더 있어야 합니까?",
        "id": "A1"
    },
    {
        "pattern": "리본 하나를 만드는데 끈 param1cm가 필요합니다. 끈 param2cm로 리본을 만들고 남는 끈의 길이는 얼마일까요?",
        "problem": "리본 하나를 만드는데 끈 27 cm가 필요합니다. 끈 685 cm로 리본을 만들고 남는 끈의 길이는 얼마일까요?",
        "keyword": "vkey 하나를 만드는데 끈 param1cm가 필요합니다. 끈 param2cm로 vkey을 만들고 남는 끈의 길이는 얼마일까요?",
        "id": "A2"
    },
    {
        "pattern": "꽃 param1 개를 만드는 데 리본 param2cm가 필요합니다. 리본 param3cm로 꽃을 만들 때 남는 리본의 길이는 몇 cm일까요?",
        "problem": "꽃 한 개를 만드는 데 리본 25cm가 필요합니다. 리본 82.3cm로 꽃을 만들 때 남는 리본의 길이는 몇 cm일까요?",
        "keyword": "꽃 param1 개를 만드는 데 vkey param2cm가 필요합니다. vkey param3cm로 꽃을 만들 때 남는 vkey의 길이는 몇 cm일까요?",
        "id": "A3"
    },
    {
        "pattern": "급식 시간에 학생들이 좋아하는 새우튀김이 나왔습니다. param1학년 학생 param2명을 위해 튀긴 새우튀김은 param3개입니다. 똑같이 최대한 나누어 주고 남은 새우튀김은 몇 개일까요?",
        "problem": "급식 시간에 학생들이 좋아하는 새우튀김이 나왔습니다. 4학년 학생 96명을 위해 튀긴 새우튀김은 215개입니다. 똑같이 최대한 나누어 주고 남은 새우튀김은 몇 개일까요?",
        "keyword": "급식 시간에 vkey들이 좋아하는 vkey튀김이 나왔습니다. param1학년 vkey param2명을 위해 튀긴 vkey튀김은 param3개입니다. 똑같이 최대한 나누어 주고 남은 vkey튀김은 몇 개일까요?",
        "id": "A4"
    },
    {
        "pattern": "길이가 param1cm인 색 테이프가 있습니다. 리본 param2 개를 만드는 데 색 테이프가 param3cm 필요할 때 리본을 만들고 난 뒤 남는 색 테이프는 몇 cm인지 구하시오.",
        "problem": "길이가 94 cm인 색 테이프가 있습니다. 리본 한 개를 만드는 데 색 테이프가 4 cm 필요할 때 리본을 만들고 난 뒤 남는 색 테이프는 몇 cm인지 구하시오.",
        "keyword": "길이가 param1cm인 색 vkey가 있습니다. vkey param2 개를 만드는 데 색 vkey가 param3cm 필요할 때 vkey을 만들고 난 뒤 남는 색 vkey는 몇 cm인지 구하시오.",
        "id": "A5"
    },
    {
        "pattern": "색종이 param1 장을 param2 명의 학생에게 똑같이 나누어 주고 남은 색종이로 종이학을 만들려고 합니다. 종이학은 모두 몇 마리 만들 수 있는지 구하시오.",
        "problem": "색종이 342 장을 15 명의 학생에게 똑같이 나누어 주고 남은 색종이로 종이학을 만들려고 합니다. 종이학은 모두 몇 마리 만들 수 있는지 구하시오.",
        "keyword": "vkey param1 장을 param2 명의 vkey에게 똑같이 나누어 주고 남은 vkey로 vkey을 만들려고 합니다. vkey은 모두 몇 마리 만들 수 있는지 구하시오.",
        "id": "A6"
    },
    {
        "pattern": "쌀 param1kg을 param2 자루에 param3kg씩 나누어 담았습니다. 쌀을 담고 남은 쌀은 몇 kg일까요?",
        "problem": "쌀 352kg을 한 자루에 20kg씩 나누어 담았습니다. 쌀을 담고 남은 쌀은 몇 kg일까요?",
        "keyword": "쌀 param1kg을 param2 자루에 param3kg씩 나누어 담았습니다. 쌀을 담고 남은 쌀은 몇 kg일까요?",
        "id": "A7"
    },
    {
        "pattern": "연필 param1 자루를 param2 상자에 param3 개씩 넣으려고 합니다. 상자에 담기지 않고 남는 연필은 몇 자루인지 구하시오.",
        "problem": "연필 187 자루를 한 상자에 20 개씩 넣으려고 합니다. 상자에 담기지 않고 남는 연필은 몇 자루인지 구하시오.",
        "keyword": "vkey param1 자루를 param2 vkey에 param3 개씩 넣으려고 합니다. vkey에 담기지 않고 남는 vkey은 몇 자루인지 구하시오.",
        "id": "A8"
    },
    {
        "pattern": "딸기 param1 개를 param2 상자에 param3 개씩 담으려고 합니다. 상자에 담고 남은 딸기의 수를 구하시오.",
        "problem": "딸기 442 개를 한 상자에 36 개씩 담으려고 합니다. 상자에 담고 남은 딸기의 수를 구하시오.",
        "keyword": "vkey param1 개를 param2 vkey에 param3 개씩 담으려고 합니다. vkey에 담고 남은 vkey의 수를 구하시오.",
        "id": "A9"
    },
    {
        "pattern": "name1네 반 학생 param1 명이 param2 줄에 param3 명씩 줄을 서려고합니다. 줄을 다 서고 남은 학생은 몇 명 입니까?",
        "problem": "민영이네 반 학생 37 명이 한 줄에 6 명씩 줄을 서려고합니다. 줄을 다 서고 남은 학생은 몇 명 입니까?",
        "keyword": "name1네 반 vkey param1 명이 param2 줄에 param3 명씩 줄을 서려고합니다. 줄을 다 서고 남은 vkey은 몇 명 입니까?",
        "id": "A10"
    },
    {
        "pattern": "진돗개 param1마리, 삽살개 param2마리, 풍산개 param3마리 중에서 param4 마리를 분양 받는 경우의 수를 구하여라.",
        "problem": "진돗개 3마리, 삽살개 4마리, 풍산개 2마리 중에서 한 마리를 분양 받는 경우의 수를 구하여라.",
        "keyword": "vkey param1마리, vkey param2마리, vkey param3마리 중에서 param4 마리를 분양 받는 경우의 수를 구하여라.",
        "id": "C1"
    },
    {
        "pattern": "티셔츠 param1 장, 바지 param2 장, 운동화 param3 켤레를 가지고 각각 param4 가지씩 착용하는 방법의 수를 구하여라.",
        "problem": "티셔츠 다섯 장, 바지 세 장, 운동화 두 켤레를 가지고 각각 한 가지씩 착용하는 방법의 수를 구하여라.",
        "keyword": "vkey param1 장, vkey param2 장, vkey param3 켤레를 가지고 각각 param4 가지씩 착용하는 방법의 수를 구하여라.",
        "id": "C2"
    },
    {
        "pattern": "사과, 복숭아, 배, 참외 중에서 param1가지의 과일을 골라서 사는 경우는 모두 몇 가지입니까?",
        "problem": "사과, 복숭아, 배, 참외 중에서 2가지의 과일을 골라서 사는 경우는 모두 몇 가지입니까?",
        "keyword": "vkey, vkey, vkey, vkey 중에서 param1가지의 vkey을 골라서 사는 경우는 모두 몇 가지입니까?",
        "id": "C3"
    },
    {
        "pattern": "남자 param1명과 여자 param2명 중에서 남자 param3명, 여자 param4명을 뽑아 일렬로 세우는 방법은 모두 몇 가지입니까?",
        "problem": "남자 5명과 여자 6명 중에서 남자 2명, 여자 3명을 뽑아 일렬로 세우는 방법은 모두 몇 가지입니까?",
        "keyword": "vkey param1명과 vkey param2명 중에서 vkey param3명, vkey param4명을 뽑아 일렬로 세우는 방법은 모두 몇 가지입니까?",
        "id": "C4_1"
    },
    {
        "pattern": "param1명의 학생 중에서 회장 param2명, 부회장 param3명을 뽑는 경우의 수를 구하시오.",
        "problem": "10명의 학생 중에서 회장 1명, 부회장 1명을 뽑는 경우의 수를 구하시오.",
        "keyword": "param1명의 vkey 중에서 vkey param2명, vkey param3명을 뽑는 경우의 수를 구하시오.",
        "id": "C4_2"
    },
    {
        "pattern": "param1 자리 수 중에서 param2로 나눌 때 나머지가 param3가 되는 수는 모두 몇 개입니까?",
        "problem": "세 자리 수 중에서 27로 나눌 때 나머지가 15가 되는 수는 모두 몇 개입니까?",
        "keyword": "param1 자리 수 중에서 param2로 나눌 때 나머지가 param3가 되는 수는 모두 몇 개입니까?",
        "id": "D6401031"
    },
    {
        "pattern": "param1 이내의 자연수 중 param2로도 나누어떨어지지 않고, param3로도 나누어떨어지지 않는 자연수는 모두 몇 개인지 구하여라.",
        "problem": "100 이내의 자연수 중 9로도 나누어떨어지지 않고, 11로도 나누어떨어지지 않는 자연수는 모두 몇 개인지 구하여라.",
        "keyword": "param1 이내의 자연수 중 param2로도 나누어떨어지지 않고, param3로도 나누어떨어지지 않는 자연수는 모두 몇 개인지 구하여라.",
        "id": "D6401033"
    },
    {
        "pattern": "param1보다 작은 param2 자리 수 중에서 숫자 param3이 들어가는 수는 모두 몇 개입니까?",
        "problem": "700보다 작은 세 자리 수 중에서 숫자 6이 들어가는 수는 모두 몇 개입니까?",
        "keyword": "param1보다 작은 param2 자리 수 중에서 숫자 param3이 들어가는 수는 모두 몇 개입니까?",
        "id": "D6401034"
    },
    {
        "pattern": "param1보다 작은 param2 자리 수 중에서 숫자 param3가 들어가는 수는 모두 몇 개입니까?",
        "problem": "500보다 작은 세 자리 수 중에서 숫자 4가 들어가는 수는 모두 몇 개입니까?",
        "keyword": "param1보다 작은 param2 자리 수 중에서 숫자 param3가 들어가는 수는 모두 몇 개입니까?",
        "id": "D6401034"
    },
    {
        "pattern": "param1보다 작은 수 중에서 숫자 param2가 들어가는 수의 개수를 구하시오.",
        "problem": "700보다 작은 수 중에서 숫자 5가 들어가는 수의 개수를 구하시오.",
        "keyword": "param1보다 작은 수 중에서 숫자 param2가 들어가는 수의 개수를 구하시오.",
        "id": "D6401035"
    },
    {
        "pattern": "param1 개의 자연수 A, B가 있습니다. A로 param2을 나눈 값에서 B로 param3을 나눈 수를 빼면 param4이 됩니다. A-B를 구하시오.",
        "problem": "두개의 자연수 A, B가 있습니다. A로 1을 나눈 값에서 B로 1을 나눈 수를 빼면 7/30이 됩니다. A-B를 구하시오.",
        "keyword": "param1 개의 자연수 A, B가 있습니다. A로 param2을 나눈 값에서 B로 param3을 나눈 수를 빼면 param4이 됩니다. A-B를 구하시오.",
        "id": "E073"
    },
    {
        "pattern": "A는 param1 자리 수입니다. 다섯자리 수 param2가 param3보다 작을 때 A가 될 수 있는 수는 모두 몇 개입니까?",
        "problem": "A는 한 자리 수입니다. 다섯자리 수 A274A가 5AA28보다 작을 때 A가 될 수 있는 수는 모두 몇 개입니까?",
        "keyword": "A는 param1 자리 수입니다. 다섯자리 수 param2가 param3보다 작을 때 A가 될 수 있는 수는 모두 몇 개입니까?",
        "id": "E074"
    },
    {
        "pattern": "A는 param1 자리 수입니다. 다섯자리 수 param2가 param3보다 작을 때 A가 될 수 있는 가장 작은 수를 구하시오.",
        "problem": "A는 한 자리 수입니다. 다섯자리 수 A274A가 5AA28보다 작을 때 A가 될 수 있는 가장 작은 수를 구하시오.",
        "keyword": "A는 param1 자리 수입니다. 다섯자리 수 param2가 param3보다 작을 때 A가 될 수 있는 가장 작은 수를 구하시오.",
        "id": "E074"
    },
    {
        "pattern": "A는 param1 자리 수입니다. 다섯자리 수 param2가 param3보다 작을 때 A가 될 수 있는 가장 큰 수를 구하시오.",
        "problem": "A는 한 자리 수입니다. 다섯자리 수 A274A가 5AA28보다 작을 때 A가 될 수 있는 가장 큰 수를 구하시오.",
        "keyword": "A는 param1 자리 수입니다. 다섯자리 수 param2가 param3보다 작을 때 A가 될 수 있는 가장 큰 수를 구하시오.",
        "id": "E074"
    },
    {
        "pattern": "A는 param1 자리 수입니다. 다섯자리 수 param2가 param3보다 작을 때 A가 될 수 있는 가장 작은 수와 큰 수의 합을 구하시오.",
        "problem": "A는 한 자리 수입니다. 다섯자리 수 A274A가 5AA28보다 작을 때 A가 될 수 있는 가장 작은 수와 큰 수의 합을 구하시오.",
        "keyword": "A는 param1 자리 수입니다. 다섯자리 수 param2가 param3보다 작을 때 A가 될 수 있는 가장 작은 수와 큰 수의 합을 구하시오.",
        "id": "E074"
    },
    {
        "pattern": "A는 param1 자리 수입니다. 다섯자리 수 param2가 param3보다 작을 때 A가 될 수 있는 작은 수와 큰 수의 차를 구하시오.",
        "problem": "A는 한 자리 수입니다. 다섯자리 수 A274A가 5AA28보다 작을 때 A가 될 수 있는 작은 수와 큰 수의 차를 구하시오.",
        "keyword": "A는 param1 자리 수입니다. 다섯자리 수 param2가 param3보다 작을 때 A가 될 수 있는 작은 수와 큰 수의 차를 구하시오.",
        "id": "E074"
    },
    {
        "pattern": "어떤 수에서 param1를 더해야 할 것을 잘못하여 나누었더니 param2이 되었습니다. 바르게 계산한 값에 param3를 곱한 값을 구하시오.",
        "problem": "어떤 수에서 253를 더해야 할 것을 잘못하여 나누었더니 584이 되었습니다. 바르게 계산한 값에 3를 곱한 값을 구하시오.",
        "keyword": "어떤 수에서 param1를 더해야 할 것을 잘못하여 나누었더니 param2이 되었습니다. 바르게 계산한 값에 param3를 곱한 값을 구하시오.",
        "id": "F2102000835"
    },
    {
        "pattern": "어떤 수에서 param1을 더해야 할 것을 잘못하여 나누었더니 param2가 되었습니다. 바르게 계산한 값에 param3을 나눈 값을 구하시오.",
        "problem": "어떤 수에서 253을 더해야 할 것을 잘못하여 나누었더니 584가 되었습니다. 바르게 계산한 값에 3을 나눈 값을 구하시오.",
        "keyword": "어떤 수에서 param1을 더해야 할 것을 잘못하여 나누었더니 param2가 되었습니다. 바르게 계산한 값에 param3을 나눈 값을 구하시오.",
        "id": "F2102000836"
    },
    {
        "pattern": "어떤 수에서 param1를 더해야 할 것을 잘못하여 나누었더니 param2가 되었습니다. 바르게 계산한 값에 param3을 나눈 값을 구하시오.",
        "problem": "어떤 수에서 253를 더해야 할 것을 잘못하여 나누었더니 584가 되었습니다. 바르게 계산한 값에 3을 나눈 값을 구하시오.",
        "keyword": "어떤 수에서 param1를 더해야 할 것을 잘못하여 나누었더니 param2가 되었습니다. 바르게 계산한 값에 param3을 나눈 값을 구하시오.",
        "id": "F2102000836"
    },
    {
        "pattern": "어떤 수에서 param1을 더해야 할 것을 잘못하여 나누었더니 param2가 되었습니다. 바르게 계산한 값에 param3를 나눈 값을 구하시오.",
        "problem": "어떤 수에서 253을 더해야 할 것을 잘못하여 나누었더니 584가 되었습니다. 바르게 계산한 값에 3를 나눈 값을 구하시오.",
        "keyword": "어떤 수에서 param1을 더해야 할 것을 잘못하여 나누었더니 param2가 되었습니다. 바르게 계산한 값에 param3를 나눈 값을 구하시오.",
        "id": "F2102000836"
    },
    {
        "pattern": "어떤 수에서 param1를 더해야 할 것을 잘못하여 나누었더니 param2가 되었습니다. 바르게 계산한 값에 param3를 나눈 값을 구하시오.",
        "problem": "어떤 수에서 253를 더해야 할 것을 잘못하여 나누었더니 584가 되었습니다. 바르게 계산한 값에 3를 나눈 값을 구하시오.",
        "keyword": "어떤 수에서 param1를 더해야 할 것을 잘못하여 나누었더니 param2가 되었습니다. 바르게 계산한 값에 param3를 나눈 값을 구하시오.",
        "id": "F2102000836"
    },
    {
        "pattern": "어떤 수에서 param1을 더해야 할 것을 잘못하여 나누었더니 param2이 되었습니다. 바르게 계산한 값에 param3을 나눈 값을 구하시오.",
        "problem": "어떤 수에서 253을 더해야 할 것을 잘못하여 나누었더니 584이 되었습니다. 바르게 계산한 값에 3을 나눈 값을 구하시오.",
        "keyword": "어떤 수에서 param1을 더해야 할 것을 잘못하여 나누었더니 param2이 되었습니다. 바르게 계산한 값에 param3을 나눈 값을 구하시오.",
        "id": "F2102000836"
    },
    {
        "pattern": "param1개의 수 sequence1이 있습니다. 이중에서 param2 보다 큰 수는 모두 몇 개입니까?",
        "problem": "5개의 수 1.7, 9/10, 2.5, 0.5, 17/10이 있습니다. 이중에서 0.6 보다 큰 수는 모두 몇 개입니까?",
        "keyword": "param1개의 수 sequence1이 있습니다. 이중에서 param2 보다 큰 수는 모두 몇 개입니까?",
        "id": "I00201"
    },
    {
        "pattern": "name1는 물통에 param1l 채웠고, name2는 param2l 채웠고, name3는 물통에 param3l 채웠습니다. 누가 더 많이 채웠습니까?",
        "problem": "석진이는 물통에 3리터 채웠고, 정국이는 4리터 채웠고, 태형이는 물통에 6리터 채웠습니다. 누가 더 많이 채웠습니까?",
        "keyword": "name1는 물통에 param1l 채웠고, name2는 param2l 채웠고, name3는 물통에 param3l 채웠습니다. 누가 더 많이 채웠습니까?",
        "id": "I00101"
    },
    {
        "pattern": "name1는 물통에 param1l 채웠습니다. name2는 param2l 채웠습니다. name3는 물통에 param3l 채웠습니다. 누가 더 많이 채웠습니까?",
        "problem": "석진이는 물통에 3리터 채웠습니다. 정국이는 4리터 채웠습니다. 태형이는 물통에 6리터 채웠습니다. 누가 더 많이 채웠습니까?",
        "keyword": "name1는 물통에 param1l 채웠습니다. name2는 param2l 채웠습니다. name3는 물통에 param3l 채웠습니다. 누가 더 많이 채웠습니까?",
        "id": "I00101"
    },
    {
        "pattern": "name1는 param1와 param2를 모았습니다. name2는 param3과 param4을 모았습니다. 누가 모은 수가 더 큽니까?",
        "problem": "정국이는 4와 4를 모았습니다. 지민이는 3과 6을 모았습니다. 누가 모은 수가 더 큽니까?",
        "keyword": "name1는 param1와 param2를 모았습니다. name2는 param3과 param4을 모았습니다. 누가 모은 수가 더 큽니까?",
        "id": "I00101"
    },
    {
        "pattern": "name1네 모둠은 남자 어린이가 param1명, 여자 어린이가 param2명이고, name2네 모둠은 남자 어린이가 param3명, 여자 어린이가 param4명입니다. 누구네 모둠이 더 많을까요?",
        "problem": "지민이네 모둠은 남자 어린이가 3명, 여자 어린이가 4명이고, 석진이네 모둠은 남자 어린이가 2명, 여자 어린이가 3명입니다. 누구네 모둠이 더 많을까요?",
        "keyword": "name1네 모둠은 vkey vkey가 param1명, vkey vkey가 param2명이고, name2네 모둠은 vkey vkey가 param3명, vkey vkey가 param4명입니다. 누구네 모둠이 더 많을까요?",
        "id": "I00101"
    },
    {
        "pattern": "name1, name2, name3는 사탕 param1개를 나누어 가졌습니다. name1는 name2보다 사탕을 param2개 적게 가지고 있고 name3는 name1보다 param3개 더 많이 가지고 있습니다. 사탕을 param4번째로 많이 가진 사람은 누구입니까?",
        "problem": "윤기, 유정, 은지는 사탕 10개를 나누어 가졌습니다. 윤기는 유정이보다 사탕을 2개 적게 가지고 있고 은지는 윤기보다 1개 더 많이 가지고 있습니다. 사탕을 2번째로 많이 가진 사람은 누구입니까?",
        "keyword": "name1, name2, name3는 vkey param1개를 나누어 가졌습니다. name1는 name2보다 vkey을 param2개 적게 가지고 있고 name3는 name1보다 param3개 더 많이 가지고 있습니다. vkey을 param4번째로 많이 가진 사람은 누구입니까?",
        "id": "I00132"
    },
    {
        "pattern": "가로의 길이가 세로의 길이 보다 param1cm크고, 세로의 길이가 param2cm인 plane1의 둘레는 몇 cm입니까?",
        "problem": "가로의 길이가 세로의 길이 보다 5cm크고, 세로의 길이가 10cm인 직사각형의 둘레는 몇 cm입니까?",
        "keyword": "가로의 길이가 세로의 길이 보다 param1cm크고, 세로의 길이가 param2cm인 plane1의 둘레는 몇 cm입니까?",
        "id": "H2400"
    },
    {
        "pattern": "name1는 철사를 이용하여 param1 변의 길이가 param2cm인 plane1을 만들었습니다. 이 철사를 곧게 펴서 가로 길이가 세로 길이보다 param3cm 긴 plane2을 만든다면, 가로 길이는 몇 cm가 되겠습니까?",
        "problem": "호석이는 철사를 이용하여 한 변의 길이가 12 cm인 정사각형을 만들었습니다. 이 철사를 곧게 펴서 가로 길이가 세로 길이보다 4 cm 긴 직사각형을 만든다면, 가로 길이는 몇 cm가 되겠습니까?",
        "keyword": "name1는 철사를 이용하여 param1 변의 길이가 param2cm인 plane1을 만들었습니다. 이 철사를 곧게 펴서 가로 길이가 세로 길이보다 param3cm 긴 plane2을 만든다면, 가로 길이는 몇 cm가 되겠습니까?",
        "id": "H2405"
    },
    {
        "pattern": "가로의 길이가 세로의 길이보다 param1cm 더 긴 plane1이 있습니다. plane1의 둘레의 길이가 param2cm일 때, 이 plane1의 넓이를 구하시오.",
        "problem": "가로의 길이가 세로의 길이보다 6 cm 더 긴 직사각형이 있습니다. 직사각형의 둘레의 길이가 96 cm일 때, 이 직사각형의 넓이를 구하시오.",
        "keyword": "가로의 길이가 세로의 길이보다 param1cm 더 긴 plane1이 있습니다. plane1의 둘레의 길이가 param2cm일 때, 이 plane1의 넓이를 구하시오.",
        "id": "H2407"
    },
    {
        "pattern": "몇 개의 구슬을 가지고 plane1 모양으로 빈틈없이 늘어놓았습니다. 이 plane1의 가로에 놓인 구슬의 개수가 세로보다 param1 개 많고, 둘레에 놓인 구슬의 개수가 param2 개라면, 구슬은 모두 몇 개인지 구하시오.",
        "problem": "몇 개의 구슬을 가지고 직사각형 모양으로 빈틈없이 늘어놓았습니다. 이 직사각형의 가로에 놓인 구슬의 개수가 세로보다 9 개 많고, 둘레에 놓인 구슬의 개수가 74 개라면, 구슬은 모두 몇 개인지 구하시오.",
        "keyword": "몇 개의 vkey을 가지고 plane1 모양으로 빈틈없이 늘어놓았습니다. 이 plane1의 가로에 놓인 vkey의 개수가 세로보다 param1 개 많고, 둘레에 놓인 vkey의 개수가 param2 개vkey, vkey은 모두 몇 개인지 구하시오.",
        "id": "H2407"
    },
    {
        "pattern": "길이가 param1cm인 철사를 구부려 가로의 길이가 세로의 길이보다 param2cm 더 긴 plane1을 만들었습니다. 만들어진 plane1의 넓이를 구하시오.",
        "problem": "길이가 68 cm인 철사를 구부려 가로의 길이가 세로의 길이보다 6 cm 더 긴 직사각형을 만들었습니다. 만들어진 직사각형의 넓이를 구하시오.",
        "keyword": "길이가 param1cm인 철사를 구부려 가로의 길이가 세로의 길이보다 param2cm 더 긴 plane1을 만들었습니다. 만들어진 plane1의 넓이를 구하시오.",
        "id": "H2407"
    }
]